---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadRailings
source: html/b133308c-6d27-83c1-4c9e-3aba6341ef1a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadRailings Property

Can't create Railings.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadRailings { get; }
```